app/Controllers/Avaliador.php

    public function dashboard()
    {
        // Instancia o modelo de Trabalho
        $trabalhoModel = new TrabalhoModel();
        $trabalhos = $trabalhoModel->findAll(); // Busca todos os trabalhos
---
SELECT *
FROM `trabalhos`